GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_flash.h
/**
  * @brief    Erase done interrupt disable
  * @rmtoll   IER    ERDIE    FL_FLASH_DisableIT_EraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_EraseComplete(FLASH_Type *FLASHx)
{
    CLEAR_BIT(FLASHx->IER, FLASH_IER_ERDIE_Msk);
}

/**
  * @brief    Get erase done interrupt enable status
  * @rmtoll   IER    ERDIE    FL_FLASH_IsEnabledIT_EraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_EraseComplete(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->IER, FLASH_IER_ERDIE_Msk) == FLASH_IER_ERDIE_Msk);
}

/**
  * @brief    Get flash key status
  * @rmtoll   ISR    KEYSTA    FL_FLASH_GetFlashLockStatus
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_KEY_STATUS_LOCK
  *           @arg @ref FL_FLASH_KEY_STATUS_ALL_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PAGE_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PROGRAM
  *           @arg @ref FL_FLASH_KEY_STATUS_ERROR
  *           @arg @ref FL_FLASH_KEY_STATUS_SECTOR_ERASE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFlashLockStatus(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_KEYSTA_Msk));
}

/**
  * @brief    Get Flash Authentication Error Flag
  * @rmtoll   ISR    AUTHERR    FL_FLASH_IsActiveFlag_AuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_AuthenticationError(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_AUTHERR_Msk) == (FLASH_ISR_AUTHERR_Msk));
}

/**
  * @brief    ClearFlash Authentication Error Flag
  * @rmtoll   ISR    AUTHERR    FL_FLASH_ClearFlag_AuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_AuthenticationError(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_AUTHERR_Msk);
}

/**
  * @brief    Get Flash Key Error Flag
  * @rmtoll   ISR    KEYERR    FL_FLASH_IsActiveFlag_KeyError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_KeyError(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_KEYERR_Msk) == (FLASH_ISR_KEYERR_Msk));
}

/**
  * @brief    Clear Flash Key Error Flag
  * @rmtoll   ISR    KEYERR    FL_FLASH_ClearFlag_KeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_KeyError(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_KEYERR_Msk);
}

/**
  * @brief    Get Erase/Program Clock Error Flag
  * @rmtoll   ISR    CKERR    FL_FLASH_IsActiveFlag_ClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ClockError(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_CKERR_Msk) == (FLASH_ISR_CKERR_Msk));
}

/**
  * @brief    Clear Erase/Program Clock Error Flag
  * @rmtoll   ISR    CKERR    FL_FLASH_ClearFlag_ClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ClockError(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_CKERR_Msk);
}

/**
  * @brief    Get Program Done Flag
  * @rmtoll   ISR    PRD    FL_FLASH_IsActiveFlag_ProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ProgramComplete(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_PRD_Msk) == (FLASH_ISR_PRD_Msk));
}

/**
  * @brief    Clear Program Done Flag
  * @rmtoll   ISR    PRD    FL_FLASH_ClearFlag_ProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ProgramComplete(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_PRD_Msk);
}

/**
  * @brief    Get Erase Done Flag
  * @rmtoll   ISR    ERD    FL_FLASH_IsActiveFlag_EraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_EraseComplete(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_ERD_Msk) == (FLASH_ISR_ERD_Msk));
}

/**
  * @brief    Clear Erase Done Flag
  * @rmtoll   ISR    ERD    FL_FLASH_ClearFlag_EraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_EraseComplete(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_ERD_Msk);
}

/**
  * @brief    Flash ECC Detect Error interrupt enable
  * @rmtoll   ERRIER   IE   FL_FLASH_EnableIT_DetectError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DetectError(FLASH_Type *FLASHx)
{
    SET_BIT(FLASHx->ERRIER, FLASH_ERRIER_IE_Msk);
}
/**
  * @brief    Flash ECC Detect Error interrupt disable
  * @rmtoll   ERRIER   IE   FL_FLASH_DisableIT_DetectError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DetectError(FLASH_Type *FLASHx)
{
    CLEAR_BIT(FLASHx->ERRIER, FLASH_ERRIER_IE_Msk);
}
/**
  * @brief    Get Flash ECC Detect Error interrupt enable status
  * @rmtoll   ERRIER   IE   FL_FLASH_IsEnabledIT_DetectError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DetectError(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ERRIER, FLASH_ERRIER_IE_Msk) == FLASH_ERRIER_IE_Msk);
}


/**
  * @brief    Parity Detection in Data Flash
  * @rmtoll   ECCSR    DD    FL_FLASH_IsActiveFlag_ParityDetectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ParityDetectionInDataFlash(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_PERDD_Msk) == (FLASH_ECCSR_PERDD_Msk));
}

/**
  * @brief    Clear Parity Detection in Data Flash Flag
  * @rmtoll   ECCSR    DD    FL_FLASH_ClearFlag_ParityDetectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ParityDetectionInDataFlash(FLASH_Type *FLASHx)
{
    SET_BIT(FLASHx->ECCSR, FLASH_ECCSR_PERDD_Msk);
    CLEAR_BIT(FLASHx->ERRIER, FLASH_ERRIER_IE_Msk);
}

/**
  * @brief    ECC Detection in Code Flash
  * @rmtoll   ECCSR    DC    FL_FLASH_IsActiveFlag_ECCDetectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInCodeFlash(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_DC_Msk) == (FLASH_ECCSR_DC_Msk));
}

/**
  * @brief    Clear ECC Detection in Code Flash Flag
  * @rmtoll   ECCSR    DC    FL_FLASH_ClearFlag_ECCDetectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInCodeFlash(FLASH_Type *FLASHx)
{
    SET_BIT(FLASHx->ECCSR, FLASH_ECCSR_DC_Msk);
    CLEAR_BIT(FLASHx->ERRIER, FLASH_ERRIER_IE_Msk);
}

/**
  * @brief    ECC Correction in Code Flash
  * @rmtoll   ECCSR    CC    FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFlash(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_CC_Msk) == (FLASH_ECCSR_CC_Msk));
}

/**
  * @brief    Clear  Correction in Code Flash Flag
  * @rmtoll   ECCSR    CC    FL_FLASH_ClearFlag_ECCCorrectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInCodeFlash(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, (FLASH_ECCSR_CC_Msk | (FLASHx->ECCSR & FLASH_ECCSR_CIE_Msk)));
}

/**
  * @brief    Get ECC Bit Error Flag
  * @rmtoll   ECCSR    BE    FL_FLASH_IsActiveFlag_ECCBitError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCBitError(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_BE_Msk) == (FLASH_ECCSR_BE_Msk));
}

/**
  * @brief    Clear ECC Bit Error Flag
  * @rmtoll   ECCSR    BE    FL_FLASH_ClearFlag_ECCBitError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCBitError(FLASH_Type *FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, (FLASH_ECCSR_BE_Msk | (FLASHx->ECCSR & FLASH_ECCSR_CIE_Msk)));
}

/**
  * @brief    ECC Correction interrupt enable
  * @rmtoll   ECCSR    CIE    FL_FLASH_EnableIT_ECCCorrection
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCCorrection(FLASH_Type *FLASHx)
{
    SET_BIT(FLASHx->ECCSR, FLASH_ECCSR_CIE_Msk);
}

/**
  * @brief    ECC Correctioninterrupt disable
  * @rmtoll   ECCSR    CIE    FL_FLASH_DisableIT_ECCCorrection
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCCorrection(FLASH_Type *FLASHx)
{
    CLEAR_BIT(FLASHx->ECCSR, FLASH_ECCSR_CIE_Msk);
}

/**
  * @brief    Get ECC Correctioninter interrupt enable status
  * @rmtoll   ECCSR    CIE    FL_FLASH_IsEnabledIT_ECCCorrection
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCCorrection(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_CIE_Msk) == FLASH_ECCSR_CIE_Msk);
}

/**
  * @brief    Get Flash ECC ERROR status
  * @rmtoll   ECCSR    FLS_SEL    FL_FLASH_IsActiveFlag_FlashSEL
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_FlashSEL(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_FLS_SEL_Msk) == (FLASH_ECCSR_FLS_SEL_Msk));
}

/**
  * @brief    Read ECC Error Address
  * @rmtoll   ECCSR    ADDR    FL_FLASH_ReadECCErrorAddress
  * @param    FLASHx FLASH instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadECCErrorAddress(FLASH_Type *FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, (0x1ffffU << 0U)) >> 0U);
}

 
/**
  * @}
  */

/** @defgroup FLASH_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_FLASH_PageErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_SectorErase(FLASH_Type *FLASHx, uint32_t address);

FL_ErrorStatus FL_FLASH_Program_Word(FLASH_Type *FLASHx, uint32_t address, uint32_t data);
FL_ErrorStatus FL_FLASH_Program_Page(FLASH_Type *FLASHx, uint32_t pageNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_Program_Sector(FLASH_Type *FLASHx, uint32_t sectorNum, uint32_t *data);

FL_ErrorStatus FL_FLASH_Write_Dma(FLASH_Type *FLASHx, uint32_t address, uint32_t *data);
FL_ErrorStatus FL_FLASH_Read_Dma(FLASH_Type *FLASHx, uint32_t address, uint32_t *data, uint32_t length);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_FLASH_H*/


/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
